{
  "headline": "Limerick Man's Legacy: From Colourful History to the Founding of Hibs",
  "subheadline": "New Book Sheds Light on Rural Ireland and the Unexpected Sporting Roots in Edinburgh",
  "story": "A new release promising to be of significant interest to Limerick readers is making waves, delving into both the vibrant history of rural Ireland and the remarkable story of a Limerick-born cleric who left an indelible mark on Scottish football. The Irish Times has highlighted three key areas of focus: 'The Irish Farm in Colour,' offering a colourised glimpse into the past, 'Edinburgh’s First Hibernian: The Mission of Edward Joseph Hanna,' which explores the life and influence of the aforementioned Limerick-born figure, and 'What’re We Like?' which examines the unique characteristics of the Irish people. This convergence of history, heritage, and sporting prowess provides a compelling narrative that is sure to captivate local audiences.",
  "pullQuote": "Edward Joseph Hanna, a Limerick cleric, is revealed as the founding figure behind Hibernian Football Club in Edinburgh, a previously little-known piece of local history.",
  "localAngle": "The connection to Limerick lies in the previously undocumented role of Edward Joseph Hanna, a local cleric who is now revealed to have been the driving force behind the establishment of Hibernian Football Club, adding a layer of international sporting history to the city's narrative.",
  "originalTitle": "A terrific colourised history of rural Ireland; and the Limerick cleric who founded Hibs",
  "originalSource": "The Irish Times",
  "originalLink": "https://www.irishtimes.com/culture/books/review/2025/11/15/a-terrific-colourised-history-of-rural-ireland-and-the-limerick-cleric-who-founded-hibs/",
  "publishedAt": "2025-11-15T16:36:00Z",
  "imageUrl": "https://www.irishtimes.com/resizer/v2/VMWOAVTIUNEV5BRV5OB74CH24Q.jpg?smart=true&auth=0a4347caee810848c887563ed3416be76f7201893140829f0e602df8c4407362&width=1200&height=630",
  "rewrittenAt": "2025-11-16T18:57:53.687Z"
}